Revit 2027 API
AnalysisDisplayLegendSettings.ShowDataDescription Property
 If true, data description is shown in the legend.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowDataDescription { get; set; }
Public Property ShowDataDescription As Boolean
	Get
	Set
public:
property bool ShowDataDescription {
	bool get ();
	void set (bool value);
}
member ShowDataDescription : bool with get, set
Property Value
Boolean
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace